Revit 2027 API
SaveAsOptions.SetWorksharingOptions Method
 Sets Worksharing options for SaveAs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetWorksharingOptions(
	WorksharingSaveAsOptions worksharingOptions
)
Public Sub SetWorksharingOptions (
	worksharingOptions As WorksharingSaveAsOptions
)
public:
void SetWorksharingOptions(
	WorksharingSaveAsOptions^ worksharingOptions
)
member SetWorksharingOptions :
        worksharingOptions : WorksharingSaveAsOptions -> unit
Parameters
worksharingOptions WorksharingSaveAsOptions
 Must be null for a non-workshared model.
 Allowed to be null for a workshared model, in which case default values for WorksharingSaveAsOptions are used.
See Also
Reference
SaveAsOptions Class
Autodesk.Revit.DB Namespace